import type { Trait } from './types';

export const traitMock: Trait = {
  id: 'dadad',
  name: 'Крепкий',
  trait_type_id: 'origin',
  requirements: 'Умение Боевой стиль',
  md_description:
    'Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием. Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием. Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием. Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием.',
  world_data: [{ id: 'gurvan-gol', name: 'Гурван-Гол' }],
};
