import type { Trait } from './types';

export const traitMock: Trait = {
  id: 4,
  name: 'Крепкий',
  traitTypeId: 'origin',
  requirements: 'Умение Боевой стиль',
  mdDescription:
    'Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием. Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием. Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием. Когда вы держите рукопашное оружие в одной руке и не держите других оружий, вы получаете бонус +2 к броскам урона этим оружием.',
  worlds: [{ id: 1, name: 'Гурван-Гол', src: '', shortDescription: '' }],
};
